app/Controllers/Pages.php

    public function dataAjax()
    {
          $model = new UserModel();
        // Kiểm tra nếu dữ liệu POST tồn tại
        if (isset($_POST['myVariable'])) {
            // Lấy dữ liệu gửi từ AJAX lên
            $data = $_POST['myVariable'];

            // Gom dữ liệu thành một mảng duy nhất
            $mergedArray = is_array($data) ? array_reduce($data, 'array_merge', []) : $data;

            // Hiển thị kết quả
            print_r($mergedArray);

            // Kiểm tra kết nối cơ sở dữ liệu
            $db = Database::connect();
            if ($db->connect()) {
                echo "Kết nối cơ sở dữ liệu thành công!";
            } else {
                echo "Lỗi kết nối cơ sở dữ liệu: " . $db->getConnection()->error();
            }

            // Chèn dữ liệu vào cơ sở dữ liệu

            if ($model->insert($mergedArray)) {
---
INSERT INTO `users` (`verify_code`, `fullname`, `licence_code`, `end_date`, `phone`, `email`, `rank`, `url_img`, `vehicle`) VALUES ('123', 'nguyenhung', '4', '2023-05-13', '3213213', 'nguyenhung@gmail.com', 'Hạng C Hạng B', 'blob:http://localhost:8080/cf16a889-5d42-4acb-b652-4fb549009462', '43J43434')

    public function renderDB()
    {
        $model = new UserModel();
        // khỏi tạo model và lấy tất cả các trường trong user đưa vào model để tương tác vs db
        $data['users'] = $model->findAll();
---
SELECT *
FROM `users`