app/Models/UserModel.php

DELETE FROM `users`
WHERE `id` = ' 31'
---
    public function deleteData($id){
        //xóa trương trong db theo id
        $this->where('id',$id)->delete();